{
    "text": [
        "Hello, I'm Jon Kido, a Full Stack and Game Developer",
        "Early life:#life",
        "\tEver since I got my hands on Legos when I was a little kid, I have been interested in creating things. My bedroom at the time had a walkable pathway from the door to the bed and a piles of legos on the ground everywhere else.",
        "\tThroughout middle school I often attended summer camps (Ida-Haven) in McCall, Idaho. This is where I realized I had a passion for Robotics, Water Sports, and Archery.",
        "\tThis journey continued all the way to high school where I took all of the Engineering classes I could, and some basic 3d modeling. This is where I got passionate about video games and created the tag V~FoS later removing the tilde.",
        "\tEnding high school I didnt have a sense of direction for colleges or degrees, there were too many options and couldn't decide; So I took a year off.",
        "University:#university",
        "\tEntering college as a part time student, I attended courses from GIMM (Games, Interactive Media, and Mobile), where I quickly fell in love with the major.",
        "\tAt the end of my first year I was contacted by the director, Anthony Ellertson, to become a peer mentor. During my job as a peer mentor I was nicknamed \"The Wizard\" because of my ability to debug everything thrown at me. Later I joined the development team for the major.",
        "Origin of VFoS:#VFoS",
        "\tVFoS was created during high school as V~FoS, when I was into the game Super Smash Bros: Melee. This tag was inspired by an Anime series I was watching at the time, Kenichi: The Mightiest Disciple. The villains of this Anime were part of a gang called The Fists of Ragnarok. My favorite villain was The Fifth Fist of Ragnarok, Hibiki Kugenin. He was a pianist who wouldn't give up and tricked his opponents by faking getting hit to do a potent counterattack. So in the end VFoS is the acronym: Fifth Fist me because of the memories I have with it."
    ]
}